# J. Дополнительная проверка на списывание

|   |   |
|---|---|
|Ограничение времени|1 секунда|
|Ограничение памяти|64Mb|
|Ввод|стандартный ввод или input.txt|
|Вывод|стандартный вывод или output.txt|

Преподаватель курса `ОиМП` заказал у одного известного психолога полное психологическое обследование всех студентов, поступивших на `ФНК` с целью выяснить их склонность к списыванию еще до начала занятий и отчислить их за списывание еще до того как они приступят к занятиям и смогут позорить `ФНК` своими преступлениями. Психолог, привлеченный для проведения обследования, известен своим инновационным методом, позволяющим понять склонность к списыванию студента по наиболее часто используемому им в программах идентификатору. Помогите известному психологу определить, какие из студентов потенциально являются преступниками. Напишите программу, которая по приведенной программе выяснит наиболее часто используемый в ней идентификатор.

Поскольку разные студенты на тестировании пишут программы на разных языках программирования, ваша программа должна уметь работать с произвольным языком. Поскольку в разных языках используются различные ключевые слова, то список ключевых слов в анализируемом языке предоставляется на вход программе. Все последовательности из латинских букв, цифр и знаков подчеркивания, которые не являются ключевыми словами и содержат хотя бы один символ, не являющийся цифрой, могут быть идентификаторами. При этом в некоторых языках идентификаторы могут начинаться с цифры, а в некоторых - нет. Если идентификатор не может начинаться с цифры, то последовательность, начинающаяся с цифры, идентификатором не является. Кроме этого, задано, является ли язык чувствительным к регистру символов, используемых в идентификаторах и ключевых словах.

## Формат ввода

В первой строке вводятся число $n$ - количество ключевых слов в языке $(0 <= n <= 50)$ и два слова $C$ и $D$, каждое из которых равно либо `yes`, либо `no`. Слово `C` равно `yes`, если идентификаторы и ключевые слова в языке чувствительны к регистру символов, и `no`, если нет. Слово $D$ равно `yes`, если идентификаторы в языке могут начинаться с цифры, и `no`, если нет.

Следующие $n$ строк содержат по одному слову, состоящему из букв латинского алфавита и символов подчеркивания - ключевые слова. Все ключевые слова непусты, различны, при этом, если язык не чувствителен к регистру, то различны и без учета регистра. Длина каждого ключевого слова не превышает $50$ символов.

Далее до конца входных данных идет текст программы. Он содержит только символы с ASCII-кодами от $32$ до $126$ и переводы строки.

Размер входных данных не превышает $10$ килобайт. В программе есть хотя бы один идентификатор.

## Формат вывода

Выведите идентификатор, встречающийся в программе максимальное число раз. Если таких идентификаторов несколько, следует вывести тот, который встречается в первый раз раньше. Если язык во входных данных не чувствителен к регистру, то можно выводить идентификатор в любом регистре.

### Пример 1
Ввод
```
0 yes no
int main() {
  int a;
  int b;
  scanf("%d%d", &a, &b);
  printf("%d", a + b);
}
```
Вывод
```
int
```

### Пример 2
Ввод
```
0 yes no
#define INT int
int main() {
  INT a, b;
  scanf("%d%d", &a, &b);
  printf("%d %d", a + b, 0);
}
```
Вывод
```
d
```

### Пример 3
Ввод
```
6 no no
program
var
begin
end
while
for
program sum;
var
  A, B: integer;
begin
  read(A, b);
  writeln(a + b);
end.
```
Вывод
```
a
```

### Пример 4
Ввод
```
1 yes yes
_
a = 0h
b = 0h
c = 0h
```
Вывод
```
0h
```

## Решение

### Общий алгоритм:
1. **Чтение параметров** - количество ключевых слов, чувствительность к регистру, возможность начинать с цифры
2. **Чтение ключевых слов** - загрузка в множество для быстрого поиска
3. **Предобработка кода** - нормализация регистра и замена пунктуации на пробелы
4. **Токенизация и анализ** - разбиение на слова, фильтрация идентификаторов, подсчет частот
5. **Выбор результата** - нахождение наиболее частого идентификатора с учетом порядка первого вхождения

### Пошаговый анализ сложности:

#### 1. Чтение ключевых слов: O(n)
- n ≤ 50 ключевых слов
- Каждое слово длиной до 50 символов
- Сложность: O(n * L) где L = 50 → O(50*50) = O(2500) = O(1)

#### 2. Предобработка кода: O(K)
- K - размер входных данных (≤10 КБ = 10240 символов)
- Приведение к нижнему регистру: O(K)
- Замена пунктуации: O(K)
- **Итого: O(K)**

#### 3. Токенизация: O(K)
- `code.split()`: O(K)
- Создание списка слов: O(K)

#### 4. Анализ идентификаторов: O(M * L)
- M - количество слов в программе (M ≤ K)
- L - средняя длина слова
- Для каждого слова:
  - Проверка в множестве ключевых слов: O(1) в среднем
  - Валидация идентификатора: O(L)
  - Обновление словарей: O(1) в среднем
- **Итого: O(M * L)**

#### 5. Поиск результата: O(P)
- P - количество уникальных идентификаторов (P ≤ M)
- Нахождение максимума: O(P)
- Фильтрация: O(P)
- Поиск минимальной позиции: O(P)

### Итоговая сложность: O(K)
- K - общий размер входных данных (10 КБ)
- Все операции линейны относительно размера входа
- Константные факторы (n ≤ 50, L ≤ 50) не влияют на асимптотику

### Ключевые оптимизации:
- **Множество ключевых слов** - O(1) проверка принадлежности
- **Словари для подсчета** - O(1) в среднем для операций добавления/обновления
- **Однопроходный анализ** - сбор статистики за один проход по словам
- **Эффективная токенизация** - предобработка пунктуации упрощает разбиение

Алгоритм оптимален для заданных ограничений и эффективно обрабатывает максимальный размер ввода.